Repository: ljnpro/GlassGPT
Catalog: modules/native-chat/Sources/NativeChatBackendComposition/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: API Configuration
zh_hans: API 配置

source: API Key Saved
zh_hans: API 密钥已保存

source: API key input
zh_hans: API 密钥输入

source: API key is invalid
zh_hans: API 密钥无效

source: API key is valid
zh_hans: API 密钥有效

source: About
zh_hans: 关于

source: Accepted Plan
zh_hans: 已采纳计划

source: Account & Sync
zh_hans: 账户与同步

source: Active Workers
zh_hans: 活跃 Worker

source: Add your API key in Settings
zh_hans: 在设置中添加 API 密钥

source: Adopted Points
zh_hans: 采纳要点

source: Advanced
zh_hans: 高级

source: Agent Defaults
zh_hans: Agent 默认值

source: Agent Mode
zh_hans: Agent 模式

source: Agent Process
zh_hans: Agent 过程

source: Agent Run
zh_hans: Agent 运行

source: Agent Settings
zh_hans: Agent 设置

source: Agent Summary
zh_hans: Agent 摘要

source: All chat and agent execution now runs through your backend account and syncs back to this device.
zh_hans: 所有聊天和 Agent 执行现已通过你的后端账户运行，并同步回这台设备。

source: An unknown error occurred.
zh_hans: 发生未知错误。

source: App theme
zh_hans: 应用主题

source: App version
zh_hans: 应用版本

source: Appearance
zh_hans: 外观

source: Ask the Agent Council
zh_hans: 向 Agent Council 提问

source: Ask the council
zh_hans: 向 council 提问

source: Assistant
zh_hans: 助手

source: Assistant response in progress
zh_hans: 助手回复进行中

source: Attach
zh_hans: 添加附件

source: Attach document
zh_hans: 附加文档

source: Attach photo
zh_hans: 附加照片

source: Attached image
zh_hans: 附加图片

source: Attached image preview
zh_hans: 附加图片预览

source: Auth
zh_hans: 认证

source: Available
zh_hans: 可用

source: Backend
zh_hans: 后端

source: Background
zh_hans: 后台

source: Cache
zh_hans: 缓存

source: Cancel
zh_hans: 取消

source: Chat
zh_hans: 聊天

source: Chat Defaults
zh_hans: 聊天默认值

source: Check Connection
zh_hans: 检查连接

source: Checking connection
zh_hans: 正在检查连接

source: Checking connection…
zh_hans: 正在检查连接…

source: Clear
zh_hans: 清除

source: Clear API key
zh_hans: 清除 API 密钥

source: Clear Custom
zh_hans: 清除自定义

source: Clear Document Cache
zh_hans: 清除文档缓存

source: Clear Image Cache
zh_hans: 清除图片缓存

source: Clearing cache
zh_hans: 正在清理缓存

source: Close preview
zh_hans: 关闭预览

source: Code Executed
zh_hans: 代码已执行

source: Code copied
zh_hans: 代码已复制

source: Collapse code execution result
zh_hans: 收起代码执行结果

source: Comparing
zh_hans: 比较中

source: Connected
zh_hans: 已连接

source: Connection Status
zh_hans: 连接状态

source: Copied
zh_hans: 已复制

source: Copy
zh_hans: 复制

source: Copy Text
zh_hans: 复制文本

source: Copy code
zh_hans: 复制代码

source: Copy message text
zh_hans: 复制消息文本

source: Current configuration
zh_hans: 当前配置

source: Current reasoning effort
zh_hans: 当前推理强度

source: Data Sharing Disclosure
zh_hans: 数据共享声明

source: Default Agent Flex Mode
zh_hans: 默认 Agent Flex 模式

source: Default Agent Leader Reasoning
zh_hans: 默认 Agent Leader 推理强度

source: Default Agent Worker Reasoning
zh_hans: 默认 Agent Worker 推理强度

source: Default Flex Mode
zh_hans: 默认 Flex 模式

source: Default Pro Mode
zh_hans: 默认 Pro 模式

source: Default reasoning effort
zh_hans: 默认推理强度

source: Degraded
zh_hans: 降级

source: Delegated Tasks
zh_hans: 委派任务

source: Delete
zh_hans: 删除

source: Delete All
zh_hans: 全部删除

source: Delete All Conversations?
zh_hans: 删除所有对话？

source: Delete all conversations
zh_hans: 删除所有对话

source: Diagnostics
zh_hans: 诊断

source: Document
zh_hans: 文档

source: Document Cache
zh_hans: 文档缓存

source: Done
zh_hans: 完成

source: Done with Agent settings
zh_hans: 完成 Agent 设置

source: Done with model settings
zh_hans: 完成模型设置

source: Double-tap to collapse
zh_hans: 双击以收起

source: Double-tap to dismiss
zh_hans: 双击以关闭

source: Double-tap to expand
zh_hans: 双击以展开

source: Double-tap to save and dismiss
zh_hans: 双击保存并关闭

source: Download Failed
zh_hans: 下载失败

source: Download to Photos
zh_hans: 下载到照片

source: Downloading file
zh_hans: 正在下载文件

source: Downloading file…
zh_hans: 正在下载文件…

source: Engine
zh_hans: 引擎

source: Error
zh_hans: 错误

source: Evidence
zh_hans: 依据

source: Expand code execution result
zh_hans: 展开代码执行结果

source: File
zh_hans: 文件

source: File Download Error
zh_hans: 文件下载错误

source: Flex Mode
zh_hans: Flex 模式

source: Gateway Configuration
zh_hans: 网关配置

source: Gateway unavailable in this build
zh_hans: 此构建中网关不可用

source: Files are cached so older links still open or share. Max cache size
zh_hans: 文件会缓存，旧链接仍可打开或分享。最大缓存大小

source: Images are cached so older links still open. Max cache size
zh_hans: 图片会缓存，旧链接仍可打开。最大缓存大小

source: Generating...
zh_hans: 正在生成...

source: Haptic Feedback
zh_hans: 触觉反馈

source: Haptic feedback
zh_hans: 触觉反馈

source: Healthy
zh_hans: 正常

source: High
zh_hans: 高

source: History
zh_hans: 历史

source: I Understand & Agree
zh_hans: 我理解并同意

source: Image Cache
zh_hans: 图片缓存

source: Image load error
zh_hans: 图片加载错误

source: Image saved to Photos
zh_hans: 图片已保存到照片

source: Invalid
zh_hans: 无效

source: Keeps Agent runs recoverable across longer interruptions.
zh_hans: 在较长时间中断后仍可恢复 Agent 运行。

source: Last checked \($0)
zh_hans: 上次检查 \($0)

source: Latency: \(latency) ms
zh_hans: 延迟：\(latency) 毫秒

source: Latest Connection Check
zh_hans: 最近连接检查

source: Launch Time
zh_hans: 启动耗时

source: Launch Timing
zh_hans: 启动计时

source: Leader
zh_hans: 领导者

source: Leader Brief
zh_hans: Leader 简报

source: Leader Decisions
zh_hans: Leader 决策

source: Leader Focus
zh_hans: Leader 焦点

source: Leader High · 3 Workers Low
zh_hans: Leader 高 · 3 个 Worker 低

source: Leader Now
zh_hans: Leader 当前状态

source: Leader Reasoning
zh_hans: Leader 推理强度

source: Leader Summary
zh_hans: Leader 摘要

source: Local storage could not be initialized.
zh_hans: 无法初始化本地存储。

source: Low
zh_hans: 低

# Lower cost, but slower and less consistent response times.
source: Lower cost, lower priority.
zh_hans: 更省成本，优先级更低。

source: Max
zh_hans: 最大

source: Med
zh_hans: 中

source: Medium
zh_hans: 中

source: Memory
zh_hans: 内存

source: Message
zh_hans: 消息

source: Missing
zh_hans: 缺失

source: Model
zh_hans: 模型

source: Native Chat
zh_hans: 原生聊天

source: New Chat
zh_hans: 新对话

source: No API key configured
zh_hans: 未配置 API 密钥

source: No Conversations Yet
zh_hans: 暂无对话

source: No messages
zh_hans: 无消息

source: None
zh_hans: 无

source: Not checked
zh_hans: 未检查

source: OK
zh_hans: 确定

source: Off
zh_hans: 关闭

source: Offline indicator
zh_hans: 离线指示器

source: On
zh_hans: 开

source: Open Account & Sync
zh_hans: 打开账户与同步

source: Open Agent settings
zh_hans: 打开 Agent 设置

source: Open Settings
zh_hans: 打开设置

source: Open model settings
zh_hans: 打开模型设置

source: Open privacy policy
zh_hans: 打开隐私政策

source: Open support website
zh_hans: 打开支持网站

source: OpenAI API Key
zh_hans: OpenAI API 密钥

source: Output
zh_hans: 输出

source: PDF load error
zh_hans: PDF 加载错误

source: Paste
zh_hans: 粘贴

source: Payloads Received
zh_hans: 已接收负载数

source: Photo
zh_hans: 照片

source: Plan
zh_hans: 计划

source: Plan Progress
zh_hans: 计划进度

source: Planning
zh_hans: 规划中

source: Platform
zh_hans: 平台

source: Privacy Policy
zh_hans: 隐私政策

source: Pro Mode
zh_hans: Pro 模式

source: Read our Privacy Policy
zh_hans: 阅读我们的隐私政策

source: Reading documents
zh_hans: 正在读取文档

source: Reading documents…
zh_hans: 正在阅读文档…

source: Realtime
zh_hans: 实时

source: Reasoning
zh_hans: 推理

source: Reasoning Completed
zh_hans: 思考完成

source: Reasoning Effort
zh_hans: 推理强度

source: Reasoning completed
zh_hans: 推理已完成

source: Reasoning effort slider
zh_hans: 推理强度滑块

source: Reasoning in progress
zh_hans: 推理进行中

source: Reasoning…
zh_hans: 思考中…

source: Recent Updates
zh_hans: 最近更新

source: Recovering response
zh_hans: 正在恢复回复

source: Recovering…
zh_hans: 正在恢复…

source: Refresh Status
zh_hans: 刷新状态

source: Regenerate
zh_hans: 重新生成

source: Remove
zh_hans: 移除

source: Remove image
zh_hans: 移除图片

source: Restoring conversation
zh_hans: 正在恢复对话

source: Restoring conversation…
zh_hans: 正在恢复对话…

source: Revoke
zh_hans: 吊销

source: Running
zh_hans: 运行中

source: Running code…
zh_hans: 正在运行代码…

source: Save
zh_hans: 保存

source: Save API key
zh_hans: 保存 API 密钥

source: Save Agent settings
zh_hans: 保存 Agent 设置

source: Save Custom
zh_hans: 保存自定义

source: Save Failed
zh_hans: 保存失败

source: Save model settings
zh_hans: 保存模型设置

source: Saved to Photos
zh_hans: 已保存到照片

source: Search
zh_hans: 搜索

# Search conversations
source: Search
zh_hans: 搜索

source: Searching the web
zh_hans: 正在搜索网页

source: Searching the web…
zh_hans: 正在搜索网页…

source: Send Agent message
zh_hans: 发送 Agent 消息

source: Send message
zh_hans: 发送消息

source: Session
zh_hans: 会话

source: Settings
zh_hans: 设置

source: Share
zh_hans: 分享

source: Share message
zh_hans: 分享消息

source: Sign In to Sync History
zh_hans: 登录以同步历史记录

source: Sign In with Apple
zh_hans: 使用 Apple 登录

source: Sign Out
zh_hans: 退出登录

source: Sign in with Apple first. Your key is stored encrypted on the backend and billed to your own OpenAI account.
zh_hans: 请先使用 Apple 登录。你的密钥会以加密形式存储在后端，并计费到你自己的 OpenAI 账户。

source: Sign in with Apple in Settings to sync conversations, agent runs, and results across devices.
zh_hans: 在“设置”中使用 Apple 登录，以便在设备之间同步对话、Agent 运行和结果。

source: Source
zh_hans: 来源

source: Sources
zh_hans: 来源

source: Standard
zh_hans: 标准

source: Start a Conversation
zh_hans: 开始对话

source: Start new Agent conversation
zh_hans: 开始新的 Agent 对话

source: Start new chat
zh_hans: 开始新对话

source: Stop Agent run
zh_hans: 停止 Agent 运行

source: Stop Reason
zh_hans: 停止原因

source: Stop generating
zh_hans: 停止生成

source: Storage Unavailable
zh_hans: 存储不可用

source: Support Website
zh_hans: 支持网站

source: Switch between GPT-5.4 and GPT-5.4 Pro.
zh_hans: 在 GPT-5.4 与 GPT-5.4 Pro 之间切换。

# Switches between GPT-5.4 and GPT-5.4 Pro.
source: Use GPT-5.4 Pro.
zh_hans: 使用 GPT-5.4 Pro。

source: Sync
zh_hans: 同步

source: System
zh_hans: 系统

source: Tap to change
zh_hans: 点按以更改

source: Theme
zh_hans: 主题

source: Applies to new chats only.
zh_hans: 仅用于新对话。

source: This action cannot be undone.
zh_hans: 此操作无法撤销。

source: Time to Interactive
zh_hans: 可交互耗时

source: Unable to download this file.
zh_hans: 无法下载此文件。

source: Unable to save this image to Photos.
zh_hans: 无法将此图片保存到照片。

source: Unauthorized
zh_hans: 未授权

source: Unavailable
zh_hans: 不可用

source: Upload failed
zh_hans: 上传失败

source: Uploading
zh_hans: 正在上传

source: Use the flex service tier for lower-priority agent runs.
zh_hans: 对较低优先级的 Agent 运行使用 Flex 服务层级。

source: Use the flex service tier for lower-priority runs.
zh_hans: 对较低优先级的运行使用 Flex 服务层级。

source: Used
zh_hans: 已用

source: Validate
zh_hans: 验证

source: Validate API key
zh_hans: 验证 API 密钥

source: Version
zh_hans: 版本

source: Waiting
zh_hans: 等待中

source: Waiting for Agent work
zh_hans: 等待 Agent 开始工作

source: Waiting for response
zh_hans: 等待回复

source: Waiting…
zh_hans: 等待中…

source: Web sources
zh_hans: 网页来源

source: Worker Reasoning
zh_hans: Worker 推理强度

source: Worker Summaries
zh_hans: Worker 摘要

source: Workers
zh_hans: 工作单元

source: Writing
zh_hans: 写作中

source: XHigh
zh_hans: 超高

source: You
zh_hans: 你

source: You are offline
zh_hans: 你当前处于离线状态

# Your API key is stored securely in the device Keychain.
source: Stored securely in Keychain.
zh_hans: 安全存于钥匙串。

source: Your OpenAI API key has been saved to Keychain.
zh_hans: 您的 OpenAI API 密钥已保存到钥匙串。

source: Your OpenAI API key has been stored on the backend for this account.
zh_hans: 你的 OpenAI API 密钥已为此账户存储在后端。

source: Your chat history will appear here.
zh_hans: 您的聊天记录会显示在这里。

# consent.cloudflare.disclosure
source: Network requests may be routed through Cloudflare for performance and reliability.
zh_hans: 网络请求可能会通过 Cloudflare 路由以提高性能和可靠性。

# consent.localstorage.disclosure
source: We do not store your conversations on our servers. All chat history is kept on your device.
zh_hans: 我们不会在服务器上存储您的对话。所有聊天记录都保存在您的设备上。

# consent.openai.disclosure
source: Your messages are sent to OpenAI to generate responses. OpenAI may process this data according to their usage policies.
zh_hans: 您的消息会发送给 OpenAI 以生成回复。OpenAI 可能会根据其使用政策处理这些数据。

# conversations_count
source: %lld conversations
zh_hans: %lld 个对话
